---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTable.GetLineweightTableIterator
source: html/fc00110d-6c93-457f-9592-5336ecc59aac.htm
---
# Autodesk.Revit.DB.ExportLineweightTable.GetLineweightTableIterator Method

Returns a ExportLineweightTableIterator that iterates through the collection.

## Syntax (C#)
```csharp
public ExportLineweightTableIterator GetLineweightTableIterator()
```

## Returns
A ExportLineweightTableIterator object that can be used to iterate through key-value pairs in the collection.